[
  {
    "_id": "2d993e62-57f7-4f5d-93a5-4b8c65a65b09",
    "title": "Traditional automakers skeptical of Tesla direct-to-consumer model despite its success: Survey",
    "description": "Tesla challenged the status quo by implementing a direct-to-consumer (DTC) sales model. While some traditional automakers have...",
    "author": "Drive Tesla Canada",
    "story": "Tesla challenged the status quo by implementing a direct-to-consumer (DTC) sales model. While some traditional automakers have hinted at embracing the same model after seeing Tesla’s success, executives at these companies are still skeptical.\nTraditional automakers have long relied on a dealership-centric model, where dealers act as the middle-man between manufacturers and consumers. In contrast, Tesla enables customers to purchase vehicles directly from the company’s website, eliminating the haggling process and streamlines the buying experience. Other EV startups have followed suit, like Lucid and Rivian.\nHowever, a recent Kerrigan Advisors study reveals the industry is still not sold on the DTC model. The study, which surveyed over 115 car company executives, found that more than one-third of respondents do not believe the model will take root in the U.S. automotive landscape. Approximately 43% expressed uncertainty about the viability of this approach, while only 22% displayed optimism. (via Business Insider)\nTesla’s DTC model has disrupted the traditional ecosystem by cutting out dealerships as intermediaries. Instead, Tesla showrooms provide a platform for customers to explore the vehicles, but transactions occur online. This divergence from the norm has prompted other automakers to consider reimagining their retail strategies.\nFord has shown signs of taking baby steps towards the DTC model. CEO Jim Farley revealed that Ford’s EV business has transitioned to a model featuring non-negotiable prices, simplified shopping experiences, and remote services.\nThe transition, however, is not without challenges. Auto dealers, known for their strong lobbying influence, have been at the forefront of resisting DTC sales. These lobbying groups have been successful in shutting down Tesla’s attempts to sell directly to consumers in several states. Despite these challenges, Tesla has been able to use workarounds by opening locations on sovereign tribal land where state laws do not apply.\nThe post Traditional automakers skeptical of Tesla’s direct-to-consumer model despite its success: Survey appeared first on Drive Tesla.\n",
    "date": "2023-08-11",
    "image": "https://images.unsplash.com/photo-1560958089-b8a1929cea89?ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxzZWFyY2h8Mnx8dGVzbGF8ZW58MHx8MHx8fDA%3D&w=1000&q=80"
  },
  {
    "_id": "4d9a2a89-f996-4666-b29e-b2f080a11c6f",
    "title": "NHTSA initiates special investigation into fatal Tesla Model Y crash",
    "description": "The National Highway Traffic Safety Administration (NHTSA) has launched a special investigation into a incident involving a Tesla Model Y colliding with a ...",
    "author": "Drive Tesla Canada",
    "story": "The National Highway Traffic Safety Administration (NHTSA) has launched a special investigation into a incident involving a Tesla Model Y colliding with a heavy truck, resulting in the death of the Tesla driver.\nThe accident occurred on July 19 in Warrenton, Virginia, when the Model Y struck a tractor-trailer truck attempting to turn onto a highway from a truck stop. The impact caused the vehicle to go underneath the trailer, leading to the driver’s unfortunate death. The driver of the truck was issued a summons for reckless driving. (via Reuters)\nThe NHTSA is looking into the accident to determine whether the Model Y was utilizing its Autopilot advanced driver assistance system at the time of the crash. This is part of a series of special crash investigations conducted by the NHTSA, involving Tesla vehicles and incidents where driver-assistance systems, such as Autopilot, were suspected to have been engaged.\nThis specific investigation marks one of more than three dozen such cases that have been opened by the NHTSA since 2016, with a total of 23 reported fatalities in these incidents.\nIn June, the NHTSA escalated its defect probe into around 830,000 Tesla vehicles equipped with Autopilot, specifically looking at incidents involving collisions with parked emergency vehicles, including fire trucks. The investigation aims to comprehensively assess the safety and reliability of Autopilot and similar systems in various driving conditions.\nThe post NHTSA initiates special investigation into fatal Tesla Model Y crash appeared first on Drive Tesla.\n",
    "date": "2023-08-11",
    "image": "https://cdn.pixabay.com/photo/2021/01/21/11/09/tesla-5937063_640.jpg"
  },
  {
    "_id": "e78b7491-27e9-4a2e-9f3c-daa94e86a2a6",
    "title": "Purported Tesla Model 3 Highland interior parts leak online",
    "description": "Several parts from the interior claimed to be from the Tesla Model 3 Project Highland refresh have been leaked online over the ...",
    "author": "Drive Tesla Canada",
    "story": "Several parts from the interior claimed to be from the Tesla Model 3 Project Highland refresh have been leaked online over the last few days, giving us what appears to be the best look yet at some of the changes to coming to the interior of the electric sedan. A close up picture of the new 18″ Aero wheels has also appeared on the Chinese version of eBay, although those wheels may be a knock off.\nThe first interior part to be shared online was of the new dash. The photo was initially shared by X user @xiaoteshushu in China. The tweet has since been deleted, apparently at the request of the parts supplier who asked for it to be removed, but as we all know the internet is forever. In the photo below the original Model 3 dash is at the bottom, while the new Highland dash is at the top.\nAs noted by former Munro & Associates president Cory Steuben points out, the new dash appears to have several more components integrated into a single piece, supporting the theory that Highland is about lower costs through manufacturing efficiencies. This photo also appears to show the new woven fabric material that will be replacing the wood trim that has been in the Model 3 since its inception. Many have been hoping that a driver display will be added to the Model 3 with this redesign, but that does not appear to be the case from this photo.\n\n\n\nThe other part of the interior that has been leaked is the door trim. Again these photos come from @xiaoteshushu, and again one of the photos has since been deleted. In the photo on the left the new door card is at the bottom, and from it we can see a new speaker has been added, as well as what looks like a new fabric on the door card itself. Although its not easy to see, an ambient lighting strip at the door card has also been added, something which we have previously reported was coming to the Model 3. We get a better view of ambient light strip in the picture on the right, which also shows us a close up look at the new fabric.\nAlso visible in the photo on the right is the new door button, which more closely resembles the buttons found in the Model S and Model X.\n\n\n\n\nThe final piece that has also leaked is a close up photo of the new 18″ Aero wheels, although we can’t be sure if these are original. As we noted this photo appeared on Chinese version of eBay, Xianyu. The listing says “Highland’s new Tesla Model 3 wheels in the third quarter of 2023. The new 8900 one, no bargaining, strong direct auction.”\nThis is definitely the correct design, and matches what was seen on an earlier test vehicle in California. However these have a silver finish, and the test vehicle had black wheels. As we have previously reported, we have also seen photos of both the new 18″ and 19″ wheels for Highland, and those were also finished in matte black, so these could be a knock-off.\n\n\n\nWith all of these leaks occurring now, we should be seeing the final version very soon. Production of the new Model 3 has already started at Giga Shanghai, beginning last week. Tesla will reportedly be alternating between production of the old Model 3 and the new Model 3, with two days dedicated for each version. This will continue for two weeks, after which the production lines will be entirely switched over to the new version starting August 14.\nThere has been no word yet on when Fremont will switch over production to the new Model 3, but that will likely happen shortly after Giga Shanghai as China’s design team has been the leader of Project Highland.\nThe post Purported Tesla Model 3 Highland interior parts leak online appeared first on Drive Tesla.\n",
    "date": "2023-08-11",
    "image": "https://images.unsplash.com/photo-1617704548623-340376564e68?ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxzZWFyY2h8MTV8fHRlc2xhfGVufDB8fDB8fHww&w=1000&q=80"
  },
  {
    "title": "Personal data of 75,000 Tesla employees compromised by ‘insider’",
    "description": "An insider has breached the personal data of 75,00...",
    "author": "Drive Tesla Canada",
    "story": "An insider has breached the personal data of 75,000 Tesla employees. The Washington Examiner said the incident affected present and former Tesla employees.\nThe data breach occurred on May 10, and Tesla promptly began to inform the affected employees. The automaker blamed ‘insider wrongdoing’ for the breach. Among the leaked data were social security numbers. However, Tesla reported no evidence the data had been misused.\nIn its message to the affected workers, Tesla said, “A foreign media outlet (named Handelsblatt) informed Tesla on May 10, 2023 that it had obtained Tesla confidential information. The investigation revealed that two former Tesla employees misappropriated the information in violation of Tesla’s IT security and data protection policies and shared it with the media outlet. The outlet has stated that it does not intend to publish the personal information, and in any event, is legally prohibited from using it inappropriately.”\nTesla added that two staff members have been identified as alleged culprits and sued in court.\nTesla is offering 12 months of IdentityWorks credit monitoring and identity theft services from Experian. The company reported 128,000 employees last year. It is very popular with job applicants, receiving 3.6 million applications last year alone.\nEarlier this year, German authorities started investigating Tesla’s Giga Berlin for alleged data protection violations.\nThe post Personal data of 75,000 Tesla employees compromised by ‘insider’ appeared first on Drive Tesla.\n",
    "date": "2023-08-20",
    "image": "https://images.unsplash.com/photo-1590510616176-67c37c34fa28?ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxzZWFyY2h8MTZ8fGNoZXZyb2xldHxlbnwwfHwwfHx8MA%3D%3D&w=1000&q=80",
    "_id": "608a3846-da67-47e1-9605-3a2c332e7b54"
  },
  {
    "title": "Tesla’s Giga Berlin faces production challenges amidst staff shortages: Report",
    "description": "Tesla’s Giga Berlin is reportedly facing productio...",
    "author": "Drive Tesla Canada",
    "story": "Tesla’s Giga Berlin is reportedly facing production issues due to staff shortages, with the production rate at the plant recently falling below 4,000 Model Ys per week.\nAccording to the most recent update from Tesla in March, Giga Berlin had achieved a production rate of 5,000 Model Y vehicles per week. However, it appears that this level of production was a one-off event, as internal documents and statements from Tesla employees indicate that the factory is struggling to maintain its production pace.\nInternal documents seen by Business Insider reveal that the factory’s production targets have been revised downwards to 870 vehicles per day, or 4,350 cars per week, well short of the 5,000 cars per week achieved five months ago. However, even that rate has been difficult to achieve, as internal sources claim that the actual production rate is currently below 4,000 cars per week.\nThe primary reason behind these challenges is a shortage of workers within the factory, with existing employees complaining about heavy workloads, shifts going unfilled, and an increase in sickness rates. The recent decision to hire fewer temporary workers and to eliminate Saturday shifts have also had an impact.\nThe Model Y remains a popular choice among European consumers, earning the status as the best-selling car through the first five months of 2023, and while the production rate is apparently lower than anticipated, it appears to be enough to meet the demand. According to Tesla’s online configurator orders placed today for any variant of the Model Y in Germany are expected to be delivered in either August or September.\n\n\n\nTesla is moving ahead with plans for a significant expansion at Giga Berlin, which will double the factory’s annual production capacity, both in terms of electric vehicles (EVs) and batteries output. According to plans submitted to local authorities, the automakers wants to increase EV production at Giga Berlin from 500,000 vehicles to 1 million vehicles annually. Additionally, Tesla is wanting double the battery production output from 50GWh to 100GWh. You can read more about Tesla’s expansion plans through previously submitted documents here.\nThe post Tesla’s Giga Berlin faces production challenges amidst staff shortages: Report appeared first on Drive Tesla.\n",
    "date": "2023-08-22",
    "image": "https://images.unsplash.com/photo-1617788138017-80ad40651399?ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxzZWFyY2h8MTF8fHRlc2xhfGVufDB8fDB8fHww&w=1000&q=80",
    "_id": "fc1b2d3b-d52e-48d3-974a-12aedc26acde"
  }
]
