[
  {
    "_id": "1",
    "title": "Traditional automakers skeptical of Tesla direct-to-consumer model despite its success: Survey",
    "description": "Tesla challenged the status quo by implementing a direct-to-consumer (DTC) sales model. While some traditional automakers have hinted at embracing the same model after seeing Tesla’s success, executives at these companies are still skeptical. Traditional [...]\nThe post Traditional automakers skeptical of Tesla’s direct-to-consumer model despite its success: Survey appeared first on Drive Tesla.",
    "author": "Drive Tesla Canada",
    "story": "Tesla challenged the status quo by implementing a direct-to-consumer (DTC) sales model. While some traditional automakers have hinted at embracing the same model after seeing Tesla’s success, executives at these companies are still skeptical.\nTraditional automakers have long relied on a dealership-centric model, where dealers act as the middle-man between manufacturers and consumers. In contrast, Tesla enables customers to purchase vehicles directly from the company’s website, eliminating the haggling process and streamlines the buying experience. Other EV startups have followed suit, like Lucid and Rivian.\nHowever, a recent Kerrigan Advisors study reveals the industry is still not sold on the DTC model. The study, which surveyed over 115 car company executives, found that more than one-third of respondents do not believe the model will take root in the U.S. automotive landscape. Approximately 43% expressed uncertainty about the viability of this approach, while only 22% displayed optimism. (via Business Insider)\nTesla’s DTC model has disrupted the traditional ecosystem by cutting out dealerships as intermediaries. Instead, Tesla showrooms provide a platform for customers to explore the vehicles, but transactions occur online. This divergence from the norm has prompted other automakers to consider reimagining their retail strategies.\nFord has shown signs of taking baby steps towards the DTC model. CEO Jim Farley revealed that Ford’s EV business has transitioned to a model featuring non-negotiable prices, simplified shopping experiences, and remote services.\nThe transition, however, is not without challenges. Auto dealers, known for their strong lobbying influence, have been at the forefront of resisting DTC sales. These lobbying groups have been successful in shutting down Tesla’s attempts to sell directly to consumers in several states. Despite these challenges, Tesla has been able to use workarounds by opening locations on sovereign tribal land where state laws do not apply.\nThe post Traditional automakers skeptical of Tesla’s direct-to-consumer model despite its success: Survey appeared first on Drive Tesla.\n",
    "date": "2023-08-10T16:48:56.000Z",
    "image": "https://images.unsplash.com/photo-1560958089-b8a1929cea89?ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxzZWFyY2h8Mnx8dGVzbGF8ZW58MHx8MHx8fDA%3D&w=1000&q=80"
  }
]
